# Casks
tap "homebrew/cask-fonts"
tap "wez/wezterm"

# Command Line
brew "bat"
brew "coreutils"
brew "direnv"
brew "fd"
brew "gh"
brew "git"
brew "lazygit"
brew "mas"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"

# GUI
cask "1password"
cask "dash"
cask "discord"
cask "flux"
cask "google-chrome"
cask "karabiner-elements"
cask "notion"
cask "spotify"
cask "visual-studio-code"
cask "wez/wezterm/wezterm"
cask "zoom"

# Fonts
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Mac App Store
mas 'Things', id: 904280696

# Dev Environments
## python
### Environment management
brew "pyenv"
### pyenv dependencies
brew "openssl"
brew "readline"
brew "sqlite3"
brew "tcl-tk"
brew "xz"
brew "zlib"
### packaging and dependency management
brew "poetry"
