# Command Line
brew "awscli"
brew "bat"
brew "coreutils"
brew "direnv"
brew "fd"
brew "gh"
brew "git"
brew "mas"
brew "mysql"
brew "neovim"
brew "pulumi"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"

tap "planetscale/tap"
brew "planetscale/tap/pscale"

# GUI
cask "1password"
cask "dash"
cask "discord"
cask "fantastical"
cask "flux"
cask "google-chrome"
cask "karabiner-elements"
cask "kindle"
cask "notion"
cask "orbstack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"

tap "wez/wezterm"
cask "wez/wezterm/wezterm"

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"

# Mac App Store
mas 'Things', id: 904280696

# Dev Environments

## node/ts/js
brew "fnm"	# environment manager
brew "pnpm" # package manager
