# Casks
tap "caskroom/cask"
tap "caskroom/fonts"

# Languages and environments
brew "go"
brew "node"
brew "pipenv"
brew "postgresql"
brew "pyenv"
brew "rbenv"
brew "ruby-build"
brew "sqlite"
brew "zsh"

# Tools
brew "colordiff"
brew "ctags"
brew "fd"
brew "findutils"
brew "fpp"
brew "git"
brew "jq"
brew "mas"
brew "neovim"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tmux"
brew "tree"

# GUI stuff
cask "1password"
cask "aerial"
cask "evernote"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "vlc"

# Fonts
cask "font-fira-code"
cask "font-source-code-pro"
